export const errText = [
  ['0xc97005002', '没有找到伙伴信息'],
  ['0xc97001003', '远程请求失败'],
  ['0xc97001004', '错误的from字段值'],
  ['0xc97001005', '错误的code值'],
  ['0xc97001006', '伙伴登录失败，token已过期'],
  ['0xc97001007', '手机号或密码错误'],
  ['0xc97001008', '无效的授权登录码'],
  ['0xc97001009', '无痕验证失败'],
  ['0xc97001010', '账号密码错误'],
  ['0xc97001001', 'SSO—TOKEN 没有找到或已过期'],
  ['0xc97003001', '角色不存在'],
  ['0xc97003002', '角色名已经存在'],
  ['0xa09004001', '获取机构信息失败'],
  ['0xa09004002', '创建云端流水异常'],
  ['0xa09004003', '不可撤回在修订单'],
  ['0xa09002001', '已经加入了等待队列'],
  ['0xa09007001', '摄影师不存在'],
  ['0xa09005001', '不可获取非本机构产品'],
  ['0xa09005002', '异常的产品状态'],
  ['0xa09001001', '修片师不存在'],
  ['0xa09003001', '流水已被接单'],
  ['0xa09003002', '流水不存在'],
  ['0xa09003003', '流水不是待修状态'],
  ['0xa09003004', '照片信息有误'],
  ['0xa09003005', '流水不是机构审核中状态'],
  ['0xa09003006', '流水不是待机构审核状态'],
  ['0xa09006001', '用户不存在'],
  ['0xa09006002', '密码错误'],
  ['0xa09006003', '用户配置信息有误'],
  ['0xa09006004', '账户级别有误'],
  ['0xa11001003', '机构不存在, upyun上传功能异常']
]
const errMap = new Map(errText)
export const errorCode = {
  getMsg: err => {
    const codeNum = Number(err.error_code)
    const hexCode = `0x${codeNum.toString(16).toLowerCase()}`
    return errMap.get(hexCode) || JSON.stringify(err.error_msg)
  }
}
